{
    "metadata": {
        "total_size": 65579515136
    },
    "weight_map": {
        "blocks.0.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.0.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.1.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.10.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.11.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.12.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.13.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.14.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.15.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.16.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.17.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.18.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.19.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.2.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.20.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.21.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.22.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.23.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.24.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.modulation": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.norm3.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.norm3.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.25.self_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.k.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.k_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.norm_k.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.norm_k_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.norm_q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.o.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.o.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.q.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.q.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.v.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.v.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.v_img.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.cross_attn.v_img.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.ffn.0.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.ffn.0.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.ffn.2.bias": "wan2.1_i2v_480p_14B_fp16.safetensors",
        "blocks.26.ffn.2.weight": "wan2.1_i2v_480p_14B_fp16.safetensors",
